*** One Environment or Two
 
Scheme has one environment which maps symbols to values. Emacs Lisp has two: A
special global environment for naming functions and a scoped environment for
naming everything else.

For example, in the Scheme form =(* (+ x y) z))= all five symbols =*=, =*=, =x=,
=y=, =z= are looked up in the current environment, i.e. the /scope/ enclosing
the /form/. Any or all of them can be changed, as shown here:

#+begin_src racket
  #lang racket
  (let ( [* string-append] [+ (λ (x y) (string-append x " " y))] [x "Hello"] [y "world"] [z "!"] )
    (* (+ x y) z) )
#+end_src

#+RESULTS:
: Hello world!

While this is pretty drastic and it's not recommended that you change the
bindings of familiar functions, it's manageable in a small scope where
everything is lexical, i.e. the scope of each symbol is obvious to any one
reading the code.

In Emacs Lisp the =let= would only affect the bindings of =x=, =y=, =z= because
the bindings of function names in the first position of a form are looked up in
the /function cells/ of the symbols, i.e. they are globally bound.

#+begin_src elisp
(cl-flet ( (* (symbol-function 'concat)) (+ (lambda (s1 s2) (concat s1 " " s2))) )
  (let ( (x "Hello") (y "world") (z "!") )
  (* (+ x y) z) ) )
#+end_src

#+RESULTS:
: Hello world!

Note:
1. =cl-flet= is one of the borrowings from the /Common Lisp/ dialect, which also
   has a separate global environment for /function cell/ bindings.
2. =cl-flet= and the traditional Emacs Lisp =let= forms use /dynamic binding/,
   which means that they save the old value of the symbol before evaluating the
   body of the expression. The old value is restored when evaluation of the
   expression is complete. *This can lead to /horrible/ bugs* when some other
   function /not/ in the lexical scope (visible to the reader) happens to use
   the same symbol for an unrelated binding and is now getting your value. See
   [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][Lexical Binding]] in the Emacs Lisp reference for how to make sure that your
   code doesn't have this vulnerability!

Like Emacs Lisp, /Common Lisp/ also stores keeps function values in the
/function cells/ of the symbol naming the function. Comm Lisp provides the
syntax =#'= to access the value of a symbol's /function cell/ so you can treat
the function value like any other value, e.g. pass it as an argument to another
function, call it with suitable arguments, etc.

In /Emacs Lisp/ =#'= is equivalent to an ordinary quote. In Emacs Lisp one is
simply passing around the symbol bound to the function instead of passing around
an actual function value. When =apply= goes to call such a "function", =apply=
notices that all it has is a /symbol/ so it fetches the function stored in the
symbol's function cell. This works, but it is not as reliable as directly using
function values. You may find out unexpectedly that that was the wrong symbol
and it doesn't have anything in its function cell! This sloppiness also slows
execution. Oh well, this is just how Emacs Lisp does it.

#+begin_src racket
#lang racket
(define (sqr x) (* x x))
(define (reduce f g alist) (apply f (map g alist)))
(define mylist (list 1 2 3 4))
(reduce + sqr mylist)
#+end_src

#+RESULTS:
: 30

- Note :: In scheme, using =list= as a name for a /list/ would shadow the =list=
  function, making it unavailable in this scope. Here that wouldn't matter, but
  shadowing the name of a popular function looks weird to a Scheme programmer
  but not to an Emacs Lisp or Common Lisp programmer!
   
#+begin_src elisp
(defun sqr (x) (* x x))
(defun reduce (f g list) (apply f (mapcar g list)))
(defvar list (list 1 2 3 4))
(reduce '+ 'sqr list)
#+end_src

#+RESULTS:
: 30

Notes
1. =defun= creates a new function value and stores it into the /function cell/ of the provided symbol.
2. =defvar= is usually used to create a global binding for an arbitrary value.
3. =setq= (not shown) would be used to /change/ a binding established earlier by =setq= or parameter passing.
    - Good design minimizes use of =setq=!
